{
    "catch_module_error": false,
    "use_modules": ["website", "json_db"],

    "texts": {
        "initial_subtitle": "Leonie & Felix --- Stoff Project --- Prototype",
        "stoff_description": "We are working on a project to generate clothing (sewing patterns) based on your size measurements and style preferences. We want to make a first big-scale test. <br /> So if you are participating at the <b>WinterAka Windischleuba Hälfte 1/2</b>, you can become one of our test subjects! See the mail for more detail or contact us at <i>felixpaetsch@gmail.com</i> if you have any questions (Or just contact Leonie ;)",

        "logged_in_subtitle": "Input your measurements!",
        "choose_design_subtitle": "Choose your design!",

        "measurements_text": [
            "Bevor du die Maße nimmst, stell dich entspannt hin, so wie du auch im Alltag stehst. Stehst du stattdessen besonders gerade, anders als im Alltag, führt das zu falschen Maßen und du wirst ein Kleidungsstück erhalten, welches dir gut passt, wenn du gerade stehst, aber sonst recht unbequem sein wird. \n\n",
            "Fahre mit deinem Finger die mittige, oberste Kante deiner Schulter entlang bis zum Ende der Armkugel. Den hier gefundenen Punkt nennen wir SP.\n ",
            "Nehme ein einfaches Stück Schnur und binde es um deine Taille. Wenn du dir nicht sicher bist, an welcher Stelle diese sich befindet hilft es, dich seitlich ",
            "zu beugen. Dort wo \"ein Knick\" entsteht, befindet sich deine Taille.\n",
            "Bei allen Maßen die du zur Taille misst, nimm dieses Band als Referenz.\n",
            "Hüftweite wird waagerecht an der Stelle der höchsten Poerhebung gemessen unter einbeziehung der Bauchwölbung.\n",
            "Hinweis: Trage immer das drunter, was du auch später unter dem hier erstellten Kleidungsstück tragen würdest, wenn du die Maße nimmst."
        ]
    },
    "measurements": [
        { "name": "1 Schulterlänge", "value": "shoulder_length", "note": "Miss vom SP der einen Seite aus bis zum anderen SP gerade über deinen Rücken." },
        { "name": "2 Schulterbreite", "value": "shoulder_width", "note": "Miss vom Halsansatz deiner Schulter bis zum SP gerade über die Schulter." },
        { "name": "3 Brustweite", "value": "bust_width", "note": "Lege das Maßband gerade an der breitesten Stelle um deine Brust. (meist dort, wo auch die Brustwarzen liegen)"},
        { "name": "4 Unterbrustweite", "value": "under_bust" , "note": "Lege das Maßband gerade direkt unterhalb deiner Brust um deine Brust."},
        { "name": "5 Brustpunktweite", "value": "bust_point_width", "note": "Miss von einer Brustwarze zur anderen." },
        { "name": "6 Brustpunkthöhe", "value": "bust_point_height", "note": "Miss von einer Brustwarze gerade runter bis zur Taille."},
        { "name": "7 Seitenhöhe", "value": "side_height", "note": "Lege zwei Finger unter deine Achsel. Nimm von der unteren Kante deiner Finger gerade runter bis zur Taille dein Maß." },
        { "name": "8 Taillenhöhe", "value": "waist_height", "note": "Nimm von der Taille aus bis zur Hüftweite an einer vergleichweise flachen Seite Senkrecht dein Maß." },
        { "name": "9 Taillenweite", "value": "waist_width", "note":  "Der Umfang deiner Taille."},
        { "name": "10 Mittlere Hüftweite", "value": "belly", "note": "Halbiere deine Taillenhöhe und nimm auf dieser Höhe erneut den Umfang." },
        { "name": "11 Schulterhöhe vorne", "value": "shoulder_height_front", "note": "Miss vom Halsansatz deiner Schulter (siehe 2) gerade nach unten über deine Brust bis zu deiner Taille." },
        { "name": "12 Mittlere Höhe vorne", "value": "center_height_front", "note": "Miss von dem Punkt wo sich deine Schlüsselbeine treffen gerade nach unten über deine Brust bis zu deiner Taille." },
        { "name": "13 Diagonale Höhe vorne", "value": "diagonal_front", "note": "Miss vom SP diagonal über deine Brust bis zur vorderen Mitte deiner Taille." },
        { "name": "14 Armabstand vorne", "value": "across_front", "note": "Miss ungefähr 10 cm tiefer vom Punkt, wo sich deine Schlüsselbeine treffen, horizontal den Abstand bis zu deinen Armen. Wichtig: Es geht hier nicht um den halben Brustumfang oder ähnliches, sondern es soll ermittelt werden, wo die Naht des Ärmels sitzen wird. Misst zu hier zu weit oder nicht weit genug, kann der Ärmel komisch sitzen. Bist du dir +- 1 oder 2 cm nicht sicher ist das kein Drama, nimm das Maß womit du dich wohl fühlst, aber vermeide Extrema. " },
        { "name": "15 Hüftweite vorne", "value": "bottom_width_front", "note": "Suche den seitlichen Punkt deiner Hüfte und halbiere anhand dessen deine Hüftweite. (Es ist unwahrscheinlich, dass es genau 50/50 halbiert wird)." },
        { "name": "16 Schulterblattbreite", "value": "shoulderblade_width", "note": "Suche den unteren, inneren Punkt des Schulterblattes beider Schulterblätter und miss bei entspanntem Rücken deren Abstand." },
        { "name": "17 Schulterblatthöhe", "value": "shoulderblade_height", "note": "Suche einen der Punkte aus 16 und nimm das Maß zur Taille gerade nach unten." },
        { "name": "18 Schulterhöhe hinten", "value": "shoulder_height_back", "note": "Siehe 11, nur über den Rücken." },
        { "name": "19 Mittlere Höhe hinten", "value": "center_height_back" , "note": "Siehe 12, nur über den Rücken."},
        { "name": "20 Diagonale Höhe hinten", "value": "diagonal_back" , "note": "Siehe 13, nur über den Rücken."},
        { "name": "21 Armabstand hinten", "value": "across_back", "note": "Siehe 14, nur über den Rücken." },
        { "name": "22 Hüftweite hinten", "value": "bottom_width_back", "note": "Siehe 15, nur die andere Hälfte."  },
        { "name": "23 Armumfang", "value": "arm", "note": "Auf Höhe wo unter der Achsel die Seitenhöhe genommen wird (siehe 7), nimm den Armumfang." },
        { "name": "24 Armlänge", "value": "arm length", "note": "Länge vom SP zum Handgelenk." },
        { "name": "25 Handgelenkumfang", "value": "wristwidth", "note": "Der Umfang des Handgelenks" },
        { "name": "26 Ellenbogenumfang", "value": "ellbow_width", "note": "Winkle den Ellenbogen ca. zur Hälfte an und nimm nun den Umfang um die breiteste Stelle." },
        { "name": "27 Ellenbogenlänge", "value": "ellbow_length", "note": "Die Länge vom SP bis zum Ellenbogen." }
    ]
}
